Show / Hide Table of Contents
Enum TwoWaySlabType
Two way slab types
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TwoWaySlabType
Fields
 Name |  Description
 DeepBeam
wall model - only membrane forces - detailing for deep beam
 ShellAsPlate
shell model - all forces - detailing for slab
 ShellAsWall
shell model - all forces - detailing for wall
 Slab
slab model - only bending forces + shell
 Wall
wall model - only membrane forces
 Improve this Doc
 View Source